cf_billing/Catalogs/энргДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.энргАбоненты</xr:Item>
				<xr:Item>Catalog.энргДоговорыКонтрагентов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>800</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестГруппыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерДоговораОРЭМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораОРЭМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестКодДоговораERP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПролонгацияДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаключенияДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыЗаключенияДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУслугиПоПередаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПролонгации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестКатегорииКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеЭкспертногоЗаключения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронноеВзаимодействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыЭлектронногоВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПотребителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДопСоглашения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиУведомленийПИР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыЭлектронногоВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеСЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаРасчеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставщикКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТарифаНезависимыйСбыт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргОтрасли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Министерство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМинистерства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСуммыДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСуммыДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактныеЛицаКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестКонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыБизнесПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектБП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьНомерПломбыПрибораУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестАктированиеНедопускаДопускаЮЛ</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьНагрузкуПоУслугам</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьФормулуРасчетаТочекУчетаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьПараметрыТочкиУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестАктПринятияПрибораУчетаККоммерческомуУчету</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменениеТемпературногоГрафикаОбъектов</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьГарантированныеОбъемыНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьЗначениеПлощадиНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТемпературыИсточника</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзмененитьРазрядностьОбъемовУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.бестОперацияСПриборомУчетаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестОперацияСУслугамиНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменениеПривязкиТочкиУчетаНПКСтруктуреСети</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьДоговорПоУслуге</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьГруппуПотребителейНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТемпературуНаружногоВоздуха</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТочкиПоставкиНаОбъектРасчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьСпособНачисленияПоНормативуНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестЗаключениеДоговоровСЮридическимиЛицами</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьПотребителейГВС</v8:Type>
								<v8:Type>cfg:DocumentRef.бестСменаПоставщикаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьДанныеДляДополнительногоРасчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьСреднемесячнуюТемпературу</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьДатуПоверкиПУ</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьПоказателиТемпературыВнутриПомещения</v8:Type>
								<v8:Type>cfg:DocumentRef.бестРегистрацияБездоговорногоБезучетногоПотребления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргДоговорыКонтрагентов/Forms/отэкФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьСтатус();
	КонецЕсли;
	
	//Если НЕ Параметры.Ключ.Пустая() Тогда
		УстановитьПараметрыОбъектыРасчета();
	//КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОбъектыРасчета()
	ТекДата				= ТекущаяДата();
	ТекОрганизация 		= Объект.Организация;
	ТекРайон			= Объект.Район;
	ТекДоговор			= Объект.Ссылка;
	
	ОбъектыРасчета.Параметры.УстановитьЗначениеПараметра("Период", 		КонецДня(ТекДата));
	ОбъектыРасчета.Параметры.УстановитьЗначениеПараметра("Организация", ТекОрганизация);
	ОбъектыРасчета.Параметры.УстановитьЗначениеПараметра("Район", 		ТекРайон);
	ОбъектыРасчета.Параметры.УстановитьЗначениеПараметра("Договор", 	ТекДоговор);	
	
	ТочкиУчета.Параметры.УстановитьЗначениеПараметра("Организация", ТекОрганизация);
	ТочкиУчета.Параметры.УстановитьЗначениеПараметра("Район", 		ТекРайон);
	ТочкиУчета.Параметры.УстановитьЗначениеПараметра("Договор", 	ТекДоговор);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", 		КонецДня(ТекДата));
	Запрос.УстановитьПараметр("Организация", 	ТекОрганизация);
	Запрос.УстановитьПараметр("Район", 			ТекРайон);
	Запрос.УстановитьПараметр("Договор", 		ТекДоговор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестГарантированныеОбъемыСрезПоследних.Период КАК Период,
	               |	бестГарантированныеОбъемыСрезПоследних.Организация КАК Организация,
	               |	бестГарантированныеОбъемыСрезПоследних.Район КАК Район,
	               |	бестГарантированныеОбъемыСрезПоследних.Договор КАК Договор,
	               |	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	ГОД(бестГарантированныеОбъемыСрезПоследних.Месяц) КАК Год,
	               |	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 1
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Январь,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 2
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Февраль,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 3
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Март,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 4
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Апрель,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 5
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Май,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 6
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Июнь,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 7
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Июль,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 8
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Август,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 9
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Сентябрь,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 10
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Октябрь,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 11
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Ноябрь,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 12
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Декабрь,
	               |	бестГарантированныеОбъемыСрезПоследних.Услуга.ЕдиницаИзмерения КАК ЕдИзмерения,
	               |	СУММА(ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 1
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 2
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 3
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 4
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 5
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 6
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 7
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 8
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 9
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 10
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 11
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ + ВЫБОР
	               |			КОГДА МЕСЯЦ(бестГарантированныеОбъемыСрезПоследних.Месяц) = 12
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ИтогГод
	               |ИЗ
	               |	РегистрСведений.бестГарантированныеОбъемы КАК бестГарантированныеОбъемыСрезПоследних
	               |ГДЕ
	               |	бестГарантированныеОбъемыСрезПоследних.Договор = &Договор
	               |	И бестГарантированныеОбъемыСрезПоследних.Район = &Район
	               |	И бестГарантированныеОбъемыСрезПоследних.Организация = &Организация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестГарантированныеОбъемыСрезПоследних.Период,
	               |	бестГарантированныеОбъемыСрезПоследних.Договор,
	               |	бестГарантированныеОбъемыСрезПоследних.Район,
	               |	бестГарантированныеОбъемыСрезПоследних.Услуга,
	               |	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета,
	               |	бестГарантированныеОбъемыСрезПоследних.Организация,
	               |	ГОД(бестГарантированныеОбъемыСрезПоследних.Месяц),
	               |	бестГарантированныеОбъемыСрезПоследних.Услуга.ЕдиницаИзмерения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(бестОбъемНачисленийНП.Период, МЕСЯЦ) КАК Период,
	               |	бестОбъемНачисленийНП.Регистратор КАК Регистратор,
	               |	бестОбъемНачисленийНП.Организация КАК Организация,
	               |	бестОбъемНачисленийНП.Район КАК Район,
	               |	бестОбъемНачисленийНП.Договор КАК Договор,
	               |	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестОбъемНачисленийНП.Услуга КАК Услуга,
	               |	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	               |	бестОбъемНачисленийНП.ВидНачисления КАК ВидНачисления,
	               |	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	               |	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	               |	бестОбъемНачисленийНП.Шкала КАК Шкала,
	               |	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	               |	бестОбъемНачисленийНП.ПериодРасчета КАК ПериодРасчета,
	               |	бестОбъемНачисленийНП.Распределение КАК Распределение,
	               |	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	               |	бестОбъемНачисленийНП.МКД КАК МКД,
	               |	бестОбъемНачисленийНП.ДолевоеРаспределение КАК ДолевоеРаспределение,
	               |	СУММА(бестОбъемНачисленийНП.ОбъемПоПрибору) КАК ОбъемПоПрибору,
	               |	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслуги,
	               |	СУММА(бестОбъемНачисленийНП.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный,
	               |	СУММА(бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ) КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	СУММА(бестОбъемНачисленийНП.ОбъемДосчитанный) КАК ОбъемДосчитанный
	               |ИЗ
	               |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	               |ГДЕ
	               |	бестОбъемНачисленийНП.Организация = &Организация
	               |	И бестОбъемНачисленийНП.Район = &Район
	               |	И бестОбъемНачисленийНП.Договор = &Договор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестОбъемНачисленийНП.ДолевоеРаспределение,
	               |	бестОбъемНачисленийНП.МКД,
	               |	бестОбъемНачисленийНП.Поставщик,
	               |	бестОбъемНачисленийНП.ПериодНачисления,
	               |	бестОбъемНачисленийНП.ТарифнаяЗона,
	               |	бестОбъемНачисленийНП.Шкала,
	               |	бестОбъемНачисленийНП.СпособНачисления,
	               |	бестОбъемНачисленийНП.ТочкаУчета,
	               |	бестОбъемНачисленийНП.Распределение,
	               |	бестОбъемНачисленийНП.Услуга,
	               |	бестОбъемНачисленийНП.ОбъектРасчета,
	               |	бестОбъемНачисленийНП.Договор,
	               |	бестОбъемНачисленийНП.Район,
	               |	бестОбъемНачисленийНП.Организация,
	               |	бестОбъемНачисленийНП.Регистратор,
	               |	бестОбъемНачисленийНП.ПериодРасчета,
	               |	бестОбъемНачисленийНП.ВидНачисления,
	               |	бестОбъемНачисленийНП.ПриборУчета,
	               |	НАЧАЛОПЕРИОДА(бестОбъемНачисленийНП.Период, МЕСЯЦ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ,
	               |	Услуга
	               |ИТОГИ ПО
	               |	Услуга,
	               |	Период";
	РезультатЗапроса 					= Запрос.ВыполнитьПакет();
	Выгрузка 							= РезультатЗапроса[0].Выгрузить();
	ДоговорныеВеличиныТЗ.Загрузить(Выгрузка);
	
	ТЗ	= Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Период");
	
	ВыборкаНачисления					= РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СчетчикУслуг	= 1;
	Колонки								= "";
	Пока ВыборкаНачисления.Следующий() Цикл
		ТекУслуга						= ВыборкаНачисления.Услуга;
		ТЗ.Колонки.Добавить("Объем" + СчетчикУслуг,,Строка(ТекУслуга));
		Колонки							= Колонки + "Объем" + СчетчикУслуг + ",";
		ВыборкаПериод					= ВыборкаНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПериод.Следующий() Цикл
			ТекПериод					= ВыборкаПериод.Период;
			ВыборкаДетал				= ВыборкаПериод.Выбрать();
			Пока ВыборкаДетал.Следующий() Цикл
				Если ВыборкаДетал.Период= ТекПериод Тогда
					НовСтрока			= ТЗ.Добавить();
					НовСтрока.Период 	= ТекПериод;
				    НовСтрока["Объем" + СчетчикУслуг] = ВыборкаДетал.ОбъемУслугиПотребленный;			
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;
		СчетчикУслуг = СчетчикУслуг + 1;
	КонецЦикла;
	Колонки = ЛЕВ(Колонки, СтрДлина(Колонки) - 1);
	ТЗ.Свернуть("Период", Колонки);
	
	ЗаполнитьИтогиДоговорныхОбъемов();
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьПараметрыДинамическихСписков(ТекОбъект = Неопределено)
	Если ТекОбъект = Неопределено Тогда 
		ТекСтрока	= Элементы.ОбъектыРасчета.ТекущиеДанные;
		Если ТекСтрока = Неопределено Тогда
			ТекОбъект	= ПредопределенноеЗначение("Справочник.бестОбъектыРасчета.ПустаяСсылка");
		КонецЕсли;	
	КонецЕсли;
	
	НагрузкиПоУслугамНП.Отбор.Элементы.Очистить();
	ЭлементОтбора = НагрузкиПоУслугамНП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекОбъект;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ТочкиУчета.Отбор.Элементы.Очистить();
	ЭлементОтбора = ТочкиУчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекОбъект;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	бестСостояниеПриборовУзловУчетаНП.Отбор.Элементы.Очистить();
	ЭлементОтбора = бестСостояниеПриборовУзловУчетаНП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекОбъект;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	бестФормулыРасчетаТочекУчетаНП.Отбор.Элементы.Очистить();
	ЭлементОтбора = бестФормулыРасчетаТочекУчетаНП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора = бестФормулыРасчетаТочекУчетаНП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекОбъект;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	
	бестОбъемНачисленийНП.Отбор.Элементы.Очистить();
	ЭлементОтбора = бестОбъемНачисленийНП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора = бестОбъемНачисленийНП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекОбъект;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;


	Обращения.Отбор.Элементы.Очистить();
	ЭлементОтбора = Обращения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПоказанияПриборовУчета.Отбор.Элементы.Очистить();
	ЭлементОтбора = ПоказанияПриборовУчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	 = Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора = ПоказанияПриборовУчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекОбъект;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Оплата.Отбор.Элементы.Очистить();
	ЭлементОтбора = Оплата.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	 = Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ГруппыТочекПоставки.Отбор.Элементы.Очистить();
	ЭлементОтбора = ГруппыТочекПоставки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Контрагент;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	// Идентификаторы ОРЭМ
	ИдентификаторыУчастниковОРЭМ.Отбор.Элементы.Очистить();
	ЭлементОтбора = ИдентификаторыУчастниковОРЭМ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Контрагент");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Контрагент;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	
	СоставУзлаУчета.Отбор.Элементы.Очистить();
	ЭлементОтбора = СоставУзлаУчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	 = Новый ПолеКомпоновкиДанных("УзелУчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ПредопределенноеЗначение("Справочник.энргПриборыУчетаАбонента.ПустаяСсылка");
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора = СоставУзлаУчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекОбъект;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	
	ЗарегистрированныеОбъемыПотребленияНП.Отбор.Элементы.Очистить();
	ЭлементОтбора = ЗарегистрированныеОбъемыПотребленияНП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора = ЗарегистрированныеОбъемыПотребленияНП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекОбъект;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	бестРазделениеОбъектовРасчетовПоРеализациям.Отбор.Элементы.Очистить();
	ЭлементОтбора = бестРазделениеОбъектовРасчетовПоРеализациям.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДоговорКонтрагента");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.НаименованиеДляПечати = Объект.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	Объект.Наименование = "Договор № " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Наименование = "Договор № " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Район) Тогда
		//	Объект.Организация = ОбщегоНазначения.получитьзна.ПолучитьРеквизитФормыПоПути(Объект.Район.;
		РайонПриИзмененииНаСервере();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	ЭтоОРЭМ																= Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.ОРЭМ");
	Элементы.Группа8.Видимость											= ЭтоОРЭМ;	
	Элементы.Группа7.Видимость											= НЕ ЭтоОРЭМ;
	Элементы.Группа10.Видимость											= НЕ ЭтоОРЭМ;
	Элементы.ГруппаУзлы.Видимость										= НЕ ЭтоОРЭМ;
	Элементы.ГруппаФормулыРасчета.Видимость								= НЕ ЭтоОРЭМ;
	Элементы.Группа11.Видимость											= НЕ ЭтоОРЭМ;
	Элементы.Группа14.Видимость											= НЕ ЭтоОРЭМ;
	Элементы.Группа21.Видимость											= НЕ ЭтоОРЭМ;
	Элементы.СтраницаЗарегистрированныеОбъемыПотребленияНП.Видимость	= НЕ ЭтоОРЭМ;
КонецПроцедуры

&НаКлиенте
Процедура ТипДоговораПриИзменении(Элемент)
	УправлениеВидимостью();
	
	ЗаполнениеРеквизитовПриИзмененииТипаДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеРеквизитовПриИзмененииТипаДоговора()
	ЭтоОРЭМ																= Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.ОРЭМ");
	Если ЭтоОРЭМ Тогда
		объект.ПризнакДоговора = ПредопределенноеЗначение("Перечисление.бестПризнакиДоговоров.Цессия");	
		
	КонецЕсли;	
	
КонецПроцедуры

//&НаСервере
//Процедура СтатусДоговораНаФорме()
//	//ТекСтатус	= ПредопределенноеЗначение("Перечисление.бестСтатусыДоговоровКонтрагентов.НеСогласован");
	//
	//Если Не Параметры.Ключ.Пустая() Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("Дата", 			КонецДня(ТекущаяДата()));
	//	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	//	Запрос.УстановитьПараметр("Договор",		Объект.Ссылка);
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	бестСостояниеДоговоровСрезПоследних.Организация КАК Организация,
	//	|	бестСостояниеДоговоровСрезПоследних.Район КАК Район,
	//	|	бестСостояниеДоговоровСрезПоследних.Договор КАК Договор,
	//	|	бестСостояниеДоговоровСрезПоследних.Состояние КАК Статус
	//	|ИЗ
	//	|	РегистрСведений.бестСостояниеДоговоров.СрезПоследних(
	//	|			&Дата,
	//	|			Организация = &Организация
	//	|				И Договор = &Договор) КАК бестСостояниеДоговоровСрезПоследних
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	бестСостояниеДоговоровСрезПоследних.Состояние,
	//	|	бестСостояниеДоговоровСрезПоследних.Организация,
	//	|	бестСостояниеДоговоровСрезПоследних.Договор,
	//	|	бестСостояниеДоговоровСрезПоследних.Район";
	//	Результат = Запрос.Выполнить();
	//	Выборка   = Результат.Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		ТекСтатус	= ?(Выборка.Статус, ПредопределенноеЗначение("Перечисление.бестСтатусыДоговоровКонтрагентов.Действует"), ПредопределенноеЗначение("Перечисление.бестСтатусыДоговоровКонтрагентов.Закрыт"));			
	//	КонецЕсли;
	//КонецЕсли;
//	
//	Статус = Документы.бестЗаключениеДоговоровСЮридическимиЛицами.ПолучитьСтатусДоговора(Объект.Ссылка, Объект.Организация, Объект.Район);;
//КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУслугу(Команда)
	ТекСтрока = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать объект расчета из ТЧ 'Объекты расчета'!");
		Возврат;
	КонецЕсли;
	
	ПарамОтк 		= Новый Структура;
	ЗнчЗаполнения 	= Новый Структура;
	ЗнчЗаполнения.Вставить("ВидОперации", 	ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслуги"));
	ЗнчЗаполнения.Вставить("Дата", 			ТекущаяДата());
	ЗнчЗаполнения.Вставить("Организация", 	Объект.Организация);
	ЗнчЗаполнения.Вставить("Район", 		Объект.Район);
	ЗнчЗаполнения.Вставить("Договор", 		Объект.Ссылка);
	ЗнчЗаполнения.Вставить("ОбъектРасчета", ТекСтрока.ОбъектРасчета);
	
	ПарамОтк.Вставить("ЗначенияЗаполнения", ЗнчЗаполнения);
	ОткрытьФорму("Документ.бестОперацияСУслугамиНП.Форма.ФормаДокументаПодключениеУслуги", ПарамОтк);
КонецПроцедуры

&НаКлиенте
Процедура ОграничениеУслуги(Команда)
	ТекСтрока = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Отказ = Ложь;
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать объект расчета из ТЧ 'Объекты расчета'!");
		Отказ = Истина;
	КонецЕсли;
	ТекСтрокаУслуга	= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекСтрокаУслуга = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать строку с услугой из ТЧ 'Услуги'!");
		Отказ = Истина;
	КонецЕсли;	
	
	Если НЕ Отказ Тогда
	
		ПарамОтк 		= Новый Структура;
		ЗнчЗаполнения 	= Новый Структура;
		ЗнчЗаполнения.Вставить("ВидОперации", 	ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ОперацияСУслугами_ОграничениеУслуги"));
		ЗнчЗаполнения.Вставить("Дата", 			ТекущаяДата());
		ЗнчЗаполнения.Вставить("Организация", 	Объект.Организация);
		ЗнчЗаполнения.Вставить("Район", 		Объект.Район);
		ЗнчЗаполнения.Вставить("Договор", 		Объект.Ссылка);
		ЗнчЗаполнения.Вставить("ОбъектРасчета", ТекСтрока.ОбъектРасчета);
		ЗнчЗаполнения.Вставить("ВидУслуги", 	ТекСтрокаУслуга.Услуга);
		
		ПарамОтк.Вставить("ЗначенияЗаполнения", ЗнчЗаполнения);
		ПарамОтк.Вставить("ЗаполнитьДокумент", 	Истина);
		ОткрытьФорму("Документ.бестОперацияСУслугамиНП.Форма.ФормаДокументаОграничениеУслуги", ПарамОтк);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПриАктивизацииСтроки(Элемент)
	ТекСтрока	= Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		УстановитьПараметрыДинамическихСписков(ТекСтрока.ОбъектРасчета);
		Элементы.ДоговорныеВеличиныТЗ.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРасчета", ТекСтрока.ОбъектРасчета);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВозобновитьУслугу(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоговорныеВеличины(Команда)
	ТекСтрока = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать объект расчета из ТЧ 'Объекты расчета'!");
		Возврат;
	КонецЕсли;	
	
	ПарамОтк 		= Новый Структура;
	ЗнчЗаполнения 	= Новый Структура;
	ЗнчЗаполнения.Вставить("Дата", 			ТекущаяДата());
	ЗнчЗаполнения.Вставить("Организация", 	Объект.Организация);
	ЗнчЗаполнения.Вставить("Район", 		Объект.Район);
	ЗнчЗаполнения.Вставить("Договор", 		Объект.Ссылка);
	ЗнчЗаполнения.Вставить("ОбъектРасчета", ТекСтрока.ОбъектРасчета);
	
	ПарамОтк.Вставить("ЗначенияЗаполнения", ЗнчЗаполнения);
	ПарамОтк.Вставить("ЗаполнитьДокумент", 	Истина);
	ОткрытьФорму("Документ.бестУстановитьГарантированныеОбъемыНП.Форма.ФормаДокумента", ПарамОтк);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНагрузкуПоУслугам(Команда)
	ТекСтрока = Элементы.НагрузкиПоУслугамНП.ТекущиеДанные;
	
	ПарамОтк 		= Новый Структура;
	ЗнчЗаполнения 	= Новый Структура;
	ЗнчЗаполнения.Вставить("Дата", 			ТекущаяДата());
	ЗнчЗаполнения.Вставить("Организация", 	Объект.Организация);
	ЗнчЗаполнения.Вставить("Район", 		Объект.Район);
	ЗнчЗаполнения.Вставить("Договор", 		Объект.Ссылка);
	ЗнчЗаполнения.Вставить("ОбъектРасчета", ТекСтрока.ОбъектРасчета);
	
	ПарамОтк.Вставить("ЗначенияЗаполнения", ЗнчЗаполнения);
	ПарамОтк.Вставить("ЗаполнитьДокумент", 	Истина);
	ОткрытьФорму("Документ.бестУстановитьНагрузкуПоУслугам.Форма.ФормаДокумента", ПарамОтк);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиДоговорныхОбъемов()
	//ТЧ				= Объект.ГарантированныеОбъемы;
	//ТЗ				= ИтогиДоговорныхВеличин.Выгрузить();
	//
	//Для каждого стр из ТЧ Цикл
	//	НовСтрока = ТЗ.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСтрока, стр);
	//	НовСтрока.ЕдиницаИзмерения = стр.Услуга.ЕдиницаИзмерения;
	//КонецЦикла;
	//ТЗ.Свернуть("IDСтроки, ЕдиницаИзмерения", "Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь");
	//ИтогиДоговорныхВеличин.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		УстановитьПараметрыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбращениеНаОсновании(Команда)
	ТекСтрока = Элементы.Обращения.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
		 ТекПарам = Новый Структура;
		 ЗаполнениеСтруктурыДляОбращений(ТекПарам, ТекСтрока.Регистратор);
		
		ОткрытьФорму("Документ.бестОбращения.Форма." + ТекПарам.ИмяФормы, ТекПарам);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовоеОбращение(Команда)
	ОповОЗакрФормыОбращ = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыОбращения", ЭтаФорма);
	РекДокумента = Новый Структура("Организация, Район, Контрагент");
	ЗаполнитьЗначенияСвойств(РекДокумента, Объект);
	РекДокумента.Вставить("Договор", Объект.Ссылка);
	РекДокумента.Вставить("ЭтапОбращения", ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_ПервичноеОбращение"));
	
	ТекОбъект = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекОбъект <> Неопределено Тогда
	    РекДокумента.Вставить("ОбъектРасчета", ТекОбъект.ОбъектРасчета);	
	КонецЕсли;
	ПарамФормы = Новый Структура("РекДокумента", РекДокумента);
	
	ОткрытьФорму("Документ.бестОбращения.Форма.ФормаДокументаОбращениеЮридическогоЛица", ПарамФормы,,,,,ОповОЗакрФормыОбращ);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияФормыОбращения(Результат, Параметры) Экспорт
	Элементы.Обращения.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСтруктурыДляОбращений(ТекПарам, ТекДок)
	ТекПарам.Вставить("Основание", ?(ЗначениеЗаполнено(ТекДок.Основание), ТекДок.Основание, ТекДок));
	ТекВидОперации = ТекДок.ВидОперации;
	Если ТекВидОперации = Перечисления.бестВидыОпераций.бестОбращения_ОбращениеФизическогоЛица Тогда
		ИмяФормы = "ФормаДокументаОбращениеФизическогоЛица";
	ИначеЕсли 
		ТекВидОперации = Перечисления.бестВидыОпераций.бестОбращения_ОбращениеЮридическогоЛица Тогда
		ИмяФормы = "ФормаДокументаОбращениеЮридическогоЛица";
	КонецЕсли;	
	ТекПарам.Вставить("ВидОперации", ТекВидОперации);
	ТекПарам.Вставить("ИмяФормы", ИмяФормы);
КонецПроцедуры

&НаКлиенте
Процедура бестСостояниеПриборовУзловУчетаНППриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.бестСостояниеПриборовУзловУчетаНП.ТекущиеДанные;
	Если НЕ ТекСтрока = Неопределено Тогда
	
		СоставУзлаУчета.Отбор.Элементы.Очистить();
		ЭлементОтбора = СоставУзлаУчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	 = Новый ПолеКомпоновкиДанных("УзелУчета");
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= ТекСтрока.ПриборУчета;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаДоговораПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.СуммаДоговора) Тогда 
		Если объект.СуммаДоговора < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма договора не может быть отрицательной");
			Объект.СуммаДоговора = Неопределено;
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УсловияОтбора 							= Новый Структура();
		УсловияОтбора.Вставить("Организация", 	Объект.Организация);
		УсловияОтбора.Вставить("Район", 		Объект.Район);
		УсловияОтбора.Вставить("Договор", 		Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Отбор", УсловияОтбора);
		ОткрытьФорму("РегистрСведений.бестСтатусыЭтаповЗаключенияДоговора.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УсловияОтбора 							= Новый Структура();
		УсловияОтбора.Вставить("Организация", 	Объект.Организация);
		УсловияОтбора.Вставить("Район", 		Объект.Район);
		УсловияОтбора.Вставить("Договор", 		Объект.Ссылка);
		//УсловияОтбора.Вставить("Период", 		Объект.Дата);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", УсловияОтбора);
		Обработчик = Новый ОписаниеОповещения("ЗаполнитьСтатус", ЭтотОбъект);
		ОткрытьФорму("РегистрСведений.бестСтатусыЭтаповЗаключенияДоговора.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,,,,Обработчик);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатус(Результат = Неопределено,ДопПараметры = Неопределено) Экспорт
	Статус = Документы.бестЗаключениеДоговоровСЮридическимиЛицами.ПолучитьСтатусДоговора(Объект.Ссылка, Объект.Организация, Объект.Район);
КонецПроцедуры
